[
{
    "image_url": "https://media.globalcitizen.org/thumbnails/fb/d1/fbd1d8fc-387e-4f7d-884a-30064b42a759/harvey-milk.jpg__1918x1736_q85_crop_subject_location-959%2C868_subsampling-2_upscale.jpg",
    "advocate_name": "Harvey Milk",
    "advocate_description": "Harvey Milk was the first openly gay politician to be elected in California. Milk was assassinated in 1978, but during his short tenure in office he pushed legislation to ban discrimination based on sexual orientation in employment and housing. The bill passed with just one dissenting vote by Dan White, the city supervisor who would go on to shoot and kill Milk."
},
{
    "image_url": "https://media.globalcitizen.org/thumbnails/d1/f5/d1f5f36b-b07a-4a4d-84c9-b2e7e03c3158/marsha-p-johnson-1.jpg__2100x1389_q85_crop_subject_location-1050%2C695_subsampling-2_upscale.jpg",
    "advocate_name": "Marsha P. Johnson",
    "advocate_description": "Johnson was black, queer, and trans — and fearlessly advocated for the rights of the LGBTQ community. Johnson was a key figure of the 1960s gay rights movement in the US and, as legend has it, threw the brick that ignited the infamous Stonewall riots, which were the catalyst for the movement and have inspired many Pride marches ever since."
},
{
    "image_url": "http://www.journeefemmeafricaine.com/wp-content/uploads/2015/06/alice-nkom-journee-femme-africaine-galerie-inspirante-cameroun.jpg",
    "advocate_name": "Alice Nkom",
    "advocate_description": "Alice Nkom is a human rights lawyer and LGBTQ activist from Cameroon, where homosexuality is still criminalized. In a country where police officer entrap members of the LGBTQ community through text messages and beat those they perceive to be gay, Nkom bravely fights for rights and call for changes on behalf of the LGBTQ community despite death threats."
},
{
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Lydia_Foy.jpg/1920px-Lydia_Foy.jpg",
    "advocate_name": "Dr. Lydia Foy",
    "advocate_description": "Lydia Annice Foy is an Irish trans woman notable for leading legal challenges regarding gender recognition in Ireland. In 1992 Foy had sex reassignment surgery and won a 20-year battle to have her birth certificate reflect her gender identity in 2017. Thanks to her efforts and others, trans community Ireland now has one of the most progressive gender recognition laws in Europe."
},
{
    "image_url": "https://i2.wp.com/www.gscene.com/wp-content/uploads/2021/03/Untitled54.png?resize=600%2C400&ssl=1",
    "advocate_name": "Ailbhe Smyth",
    "advocate_description": "Feminist and lesbian activist, Ailbhe Smyth has been involved in radical politics in Ireland for over four decades and was a spokeswoman and convenor for the Coalition to Repeal the Eighth Amendment. She is also a founding member of Marriage Equality, convenor of Feminist Open Forum, an organiser for Action for Choice and is the former Chair of the National LGBT Federation."
},
{
    "image_url": "https://images.news.iu.edu/dams/q9iccagiar_w768.jpg",
    "advocate_name": "Laverne Cox",
    "advocate_description": "Laverne Cox jumped is famous for playing transgender inmate Sophia Burset on Netflix's 'Orange Is the New Black'. For her role in the series, Cox was nominated for three Emmy Awards. In 2014, she was the first openly transgender person to be nominated for a Primetime Emmy in an acting category. She is also known as an activist for transgender rights"
},
{
    "image_url": "https://www.independent.ie/migration_catalog/93247/25240046.ece/AUTOCROP/w620/norris_SH",
    "advocate_name": "David Norris",
    "advocate_description": "David Patrick Bernard Norris is an Irish civil rights campaigner, former university lecturer, and longtime member of Seanad Éireann (the Irish Senate). He is the founder of the Campaign for Homosexual Law Reform. He is a prominent member of the Church of Ireland. David Norris was the first openly gay person to be elected to public office in Ireland."
}
]

