[
{
    "Image_url": "https://www.unco.edu/gender-sexuality-resource-center/images/pride-flags/Ally-Pride.jpg",
    "flag_name": "Ally Pride Flag",
    "flag_description": "Although the precise origin of the Ally Pride Flag is unknown, it was created sometime in the late 2000s as a symbol of the heterosexual and/or cisgender people who actively support LGBTQ individuals. The “A” in the center of the flag stands for the word ally and features the six colors of the rainbow pride flag. The black and white stripes in the background represent heterosexual and/or cisgender people.",
    "group": "Ally",
    "group_definition": "People who aren’t a part of the LGBTQA+ community, but do support them."
},
{
    "Image_url": "https://www.unco.edu/gender-sexuality-resource-center/images/pride-flags/Aromantic-Pride.jpg",
    "flag_name": "Aromantic Pride Flag",
    "flag_description": "The Aromantic Flag represents people who either do not experience romantic attraction or do so in a non-traditional way. It’s not known when the first version of the flag was created, but the current one was designed in 2014. The color green represents aromanticism, which appears in two shades in the flag, along with white (platonic and aesthetic attraction), gray (gray-aromantic and demiromantic people), and black (the sexuality spectrum).",
    "group": "Aromantic",
    "group_definition": "Someone who does not experience romantic attraction, or does so in a significantly different way than is traditionally thought of."
},
{
    "Image_url": "https://www.unco.edu/gender-sexuality-resource-center/images/pride-flags/Asexual-Pride.jpg",
    "flag_name": "Asexual Pride Flag",
    "flag_description": "Asexual individuals — who lack sexual attraction to all genders — also got their own flag in 2010, following a contest held by the Asexual Visibility and Education Network (AVEN). Like the other LGBTQ flags, this one has a variety of colored stripes, each with its own meaning: Black for Asexuality,  Gray for Gray-asexuality and demisexuality,  White for Non-asexual partners and allies, Purple for Community.",
    "group": "Asexuality:",
    "group_definition": "The lack of sexual attraction to all genders."
},
{
    "Image_url": "https://www.unco.edu/gender-sexuality-resource-center/images/pride-flags/Bisexual-Pride.jpg",
    "flag_name": "Bisexual Pride Flag",
    "flag_description": "Florida-based LGBTQ activist Michael Page created the Bisexual Flag in 1998, in order to increase the visibility of bisexual individuals — who are attracted to two genders — in both the LGBTQ community and society as a whole. The pink represents attraction to those of the same gender identity, while the blue stands for attraction to people who identify as a different gender. The purple stripe symbolizes attraction to two genders.",
    "group": "Bisexuality",
    "group_definition": "The physical or romantic attraction to two genders"
},
{
    "Image_url": "https://www.unco.edu/gender-sexuality-resource-center/images/pride-flags/Butch-Lesbian-Pride.jpg",
    "flag_name": "Butch Lesbian Pride Flag",
    "flag_description": "The first butch lesbian pride flag was created in 2016 by tumbler user dorian—rutherford. The flag was designed for lesbians who do not identify with the lipstick lesbian flag due to its feminine nature. The original post was deleted from the tumbler, but later resurfaced on deviantart.com. Another variation of the butch flag was created in 2017 by tumbler user butchspace to represent butch positivity. Both variations of the butch lesbian flag are still slowly gaining traction in the community.\n\nAlthough the creator never explicitly explained the meaning of the colors, people have guessed that the blue represents masculinity, the purple represents lesbian and woman-identified individuals, and the white represents people across the gender and sexuality spectrums more broadly. The butch lesbian flag is one variation of several lesbian flags, including the lipstick lesbian flag and labrys lesbian flag.",
    "group": "Butch Lesbian",
    "group_definition": "A female-identified person who likes other female-identified people and presents more traditionally “masculine” in appearance."
},
{
    "Image_url": "https://www.unco.edu/gender-sexuality-resource-center/images/pride-flags/CO-Pride.jpg",
    "flag_name": "Colorado Pride Flag",
    "flag_description": "The Colorado Pride Flag combines the original Colorado state flag with the rainbow stripes from the LGBTQA+ pride flag. The flag has rapidly gained popularity since 2016, and can be seen at local pride parades.\n\nAlong with the Colorado LGBTQA+ Pride Flag, many other U.S. states have their own versions of their state flags with rainbow coloring added to represent LGBTQA+ Pride."
},
{
    "Image_url": "https://www.unco.edu/gender-sexuality-resource-center/images/pride-flags/Demisexual-Pride.jpg",
    "flag_name": "Demisexual Pride Flag",
    "flag_description": "The Demisexual Pride Flag represents a section of the asexual community that develops sexual attraction to someone only after forming a deep emotional bond with them. It’s unknown when, exactly, the flag was created, but it includes four colors: black (representing asexuality), gray (asexuality and demisexuality), white (sexuality), and purple (community).",
    "group": "Demisexual",
    "group_definition": "Feeling sexual attraction to someone only after forming a deep emotional bond with them. Part of the broader asexual community."
},
{
    "Image_url": "https://www.unco.edu/gender-sexuality-resource-center/images/pride-flags/Genderfluid-Pride.jpg",
    "flag_name": "Genderfluid Pride Flag",
    "flag_description": "JJ Poole created the Genderfluid Pride Flag in 2013 to represent folks whose gender identity and/or expression is fluid and may fluctuate at different times or in different circumstances. The flag has five horizontal stripes of different colors representing femininity (pink), lack of gender (white), a combination of both masculinity and femininity (purple), all genders anywhere on the spectrum (black), and masculinity (blue).",
    "group": "Genderfluid",
    "group_definition": "People who have a gender expression/expressions or identity/identities that are not constant or fixed."
},
{
    "Image_url": "https://www.unco.edu/gender-sexuality-resource-center/images/pride-flags/GenderQueer-Pride.jpg",
    "flag_name": "Genderqueer Pride Flag",
    "flag_description": "There is also a Genderqueer Flag, which writer and activist Marilyn Roxie designed in 2011—with input from the readers of the website Genderqueer Identities. As the combination of the traditionally masculine and feminine colors (blue and pink), lavender represents androgyny and other queer identities, while white stands for agender identity, and green represents those whose identities are defined outside the binary.",
    "group": "Genderqueer",
    "group_definition": "People whose gender identity does not fit within the male/female binary."
},
{
    "Image_url": "https://www.unco.edu/gender-sexuality-resource-center/images/pride-flags/Intersex-Pride.jpg",
    "flag_name": "Intersex Pride Flag",
    "flag_description": "The Intersex Pride Flag has been in existence since 2013, when Morgan Carpenter, then co-chair of Organization Intersex International Australia, created and launched it. Unimpressed with some of the other symbols for intersex individuals, Carpenter wanted a flag “that is not derivative, but is yet firmly grounded in meaning,” and eventually landed on the version we know today, which features a purple circle on a yellow background. The circle represents wholeness and completeness, whith purple and yellow seen as gender-neutral colors.",
    "group": "Intersex",
    "group_definition": "A person born with physical sex characteristics that don’t fit the traditional definitions for male or female bodies."
},
{
    "Image_url": "https://www.unco.edu/gender-sexuality-resource-center/images/pride-flags/Labrys-Pride.jpg",
    "flag_name": "Labrys Lesbian Pride Flag",
    "flag_description": "Not as well known as other LGBTQ flags, the Labrys Lesbian Pride Flag has been around since 1999. A labrys is a double-headed battle-ax seen on the flag, which can be traced back to matriarchal societies like the Minoans. Seen as a symbol of empowerment for cisgender women, it was adopted by some lesbian radical feminist groups in the 1970s. Purple represents cisgender women, while the black triangle symbolizes lesbians.",
    "group": "Labrys",
    "group_definition": "A double-headed battle axe most commonly associated with the Minoan ancient civilization, the Amazons, and the Greek goddess Demeter."
},
{
    "Image_url": "https://www.unco.edu/gender-sexuality-resource-center/images/pride-flags/Lesbian-Pride.jpg",
    "flag_name": "Lesbian Pride Flag",
    "flag_description": "Although there are multiple versions of a Lesbian Pride Flag, this one—which has been around since 2018—appears to be the one that’s most widely embraced. The seven different shades of pink, orange, white, and red were used to represent different types of femininity.",
    "group": "Lesbian",
    "group_definition": "A female-identified person who is attracted to other female-identified people, and also presents more traditionally “feminine” in appearance."
},
{
    "Image_url": "https://www.unco.edu/gender-sexuality-resource-center/images/pride-flags/Non-Binary-Pride.jpg",
    "flag_name": "Non-Binary Pride Flag",
    "flag_description": "This LGBTQ flag was created in 2014 to represent people whose gender identity does not fit within the traditional male/female binary, with the intention of flying alongside the Genderqueer Pride Flag instead of replacing it. Its colors symbolize those whose gender falls outside of and without reference to the binary (yellow), people with many or all genders (white), those whose gender identity falls somewhere between male/female or is a mix of them (purple), and people who feel they are without a gender (black).",
    "group": "Non-Binary",
    "group_definition": "People whose gender identity does not fit within the traditional male/female binary."
},
{
    "Image_url": "https://www.unco.edu/gender-sexuality-resource-center/images/pride-flags/Pansexual-Pride.jpg",
    "flag_name": "Pansexual Pride Flag",
    "flag_description": "Pansexual folks—who are attracted to people regardless of their gender identity—got their own flag around 2010, in order to both increase their overall visibility and help differentiate the group from bisexual individuals. Here, the pink represents attraction to people who identify as female, while the blue stands for attraction to those who identify as male. The yellow stripe in the middle represents attraction to those who identify as genderqueer, non-binary, agender, androgynous, or anyone who doesn’t identify on the male-female binary.",
    "group": "Pansexuality",
    "group_definition": "The attraction to people regardless of their gender identity."
},
{
    "Image_url": "https://www.unco.edu/gender-sexuality-resource-center/images/pride-flags/Philly-Pride.jpg",
    "flag_name": "Philadelphia Pride Flag",
    "flag_description": "The Philadelphia Pride Flag represents LGBTQ people of color, who historically were not always included in aspects of the mainstream gay rights movement. In addition to the original six stripes, this flag includes black and brown, symbolizing people of color. It was unveiled on June 8, 2017, at Philadelphia City Hall, and was designed by a small Philly-based PR agency.",
    "group": "LGBTQA+",
    "group_definition": "Lesbian, Gay, Bisexual, Transgender, Questioning, Asexual, and all other identities that fall into the LGBTQA+ community across the gender, sexuality, and romantic spectrums."
},
{
    "Image_url": "https://www.unco.edu/gender-sexuality-resource-center/images/pride-flags/Polyamorous-Pride.jpg",
    "flag_name": "Polyamorous Pride Flag",
    "flag_description": "When Jim Evans created the Polyamory Flag in 1995, he wanted it to be a symbol—and sign—for people who identify as polyamorous. The background of the flag has three stripes: blue (representing the openness and honesty of all parties involved in the relationships), red (love and passion), and black (solidarity with those who must hide their polyamorous relationships from the outside world). Evans placed a yellow pi symbol in the middle of his flag, with the infinite number representing the infinite options for partners available to polyamorous people. An alternative version of the flag was also created in 2017, which replaces the pi symbol with the infinity hearts symbol.",
    "group": "Polyamory",
    "group_definition": "The ability to love multiple people and/or be involved in multiple relationships within the context of mutual consent."
},
{
    "Image_url": "https://www.unco.edu/gender-sexuality-resource-center/images/pride-flags/Polysexual-Pride.jpg",
    "flag_name": "Polysexual Pride Flag",
    "flag_description": "Polysexual people—who are sexually attracted to multiple, but not all, genders—got their own flag in 2012. It was designed by a Tumblr user with the signature “Samlin.” Both the colors and the design borrowed from the Bisexual and Pansexual flags, including blue and pink (representing attraction to those who identify as male and female, respectively) and green (which represents attraction to people who identify outside the traditional male-female binary).",
    "group": "Polysexual",
    "group_definition": "Someone who is sexually attracted to multiple, but not all, genders."
},
{
    "Image_url": "https://www.unco.edu/gender-sexuality-resource-center/images/pride-flags/Rainbow-Pride.jpg",
    "flag_name": "Rainbow Pride Flag",
    "flag_description": "It would take another year before the original LGBTQ rainbow flag completed its evolution. After losing its pink stripe in 1978, the turquoise stripe would meet the same fate in 1979. There are two possible explanations: that, like the hot pink, the turquoise material was also difficult to get, or that people preferred a flag with an even number of stripes. Either way, that change left us with the six colored stripes that still adorn the flag today.",
    "group": "LGBTQA+",
    "group_definition": "Lesbian, Gay, Bisexual, Transgender, Questioning/Queer, Asexual, and all other identities that fall into the LGBTQA+ community."
},
{
    "Image_url": "https://www.unco.edu/gender-sexuality-resource-center/images/pride-flags/Trans-Pride.jpg",
    "flag_name": "Transgender Pride Flag",
    "flag_description": "The Transgender Flag has been around since 1999 when an American transgender Navy veteran named Monica Helms created it. A year later, the flag made its debut at a Pride parade in Phoenix. Light blue and pink are featured because they’re the traditional colors associated with baby boys and girls, respectively. The white represents those who are intersex, transitioning, or see themselves as having a neutral or undefined gender",
    "group": "Transgender",
    "group_definition": "People whose gender identity doesn’t align with the sex they were assigned at birth."
},
{
    "Image_url": "https://www.unco.edu/gender-sexuality-resource-center/images/pride-flags/Two-Spirit-Pride.jpg",
    "flag_name": "Two-Spirit Pride Flag",
    "flag_description": "Some Indigenous Americans identify as two-spirit individuals—meaning they fall outside the male-female binary, and this can be used to describe a person’s sexual, gender, and/or spiritual identity. Though it’s not clear when it was first designed, the two feathers on the Two-Spirit Flag represent masculine and feminine identities, while the circle symbolizes the unification of masculine and feminine identities into a separate gender, and the rainbow of colors represents modern LGBTQ identities.",
    "group": "Two-spirit",
    "group_definition": "An umbrella term to identify queer Native American individuals with traditional and cultural understandings of gender roles and identity."
},
{
    "Image_url": "https://www.rd.com/wp-content/uploads/2021/05/gilbert-baker-pride-flag.jpg?resize=700,467",
    "flag_name": "Gilbert Baker Pride Flag",
    "flag_description": "Picture it: San Francisco, 1974. An artist, activist, and openly gay military veteran named Gilbert Baker meets fellow activist, future politician, and LGBTQ hero Harvey Milk. Three years later, Milk challenges Baker to create a symbol for the gay community, and the end product is the first rainbow LGBTQ flag. Baker’s creation made its debut at the San Francisco Gay Freedom Day Parade on June 25, 1978—only a few months before Milk was assassinated."
},
{
    "Image_url": "https://www.rd.com/wp-content/uploads/2021/05/1978-pride-flag.jpg?resize=700,467",
    "flag_name": "1978 Pride Flag",
    "flag_description": "If this LGBTQ flag looks familiar, that’s because it’s Baker’s design with one modification: The hot pink stripe in his original 1977 flag was removed. Each color in the flag had a meaning, and hot pink stood for sex, but that’s not the reason for its disappearance. After Milk was murdered, the demand for the flag he commissioned increased, but both Baker and the Paramount Flag Company (which manufactured the flag) found that hot pink fabric was hard to come by and ended up leaving it out."
},
{
    "Image_url": "https://www.rd.com/wp-content/uploads/2021/05/progress-pride-flag-1.jpg?resize=700,467",
    "flag_name": "Progress Pride Flag",
    "flag_description": "A year after the debut of the Philadelphia Pride Flag, Oregon-based designer Daniel Quasar introduced a reworked version of the more inclusive flag. “When the Pride flag was recreated in the last year to include both black/brown stripes as well as the trans stripes included this year, I wanted to see if there could be more emphasis in the design of the flag to give it more meaning,” Quasar explained in a 2018 Kickstarter post raising money for the new flag. The white, pink, and light blue striped chevron design on the Progress Pride Flag reflect the colors of the Transgender Flag, while the brown and black stripes represent people of color and those lost to AIDS."
},
{
    "Image_url": "https://www.rd.com/wp-content/uploads/2021/05/leather-pride-flag-1.jpg?resize=700,467",
    "flag_name": "Leather Pride Flag",
    "flag_description": "Though originally representative of members of the leather subculture, this flag was also embraced by the wider BDSM and fetish community. Designed by Tony DeBlase for Chicago’s International Mr. Leather celebration in 1989 to mark the 20th anniversary of the Stonewall Riots, the symbol represents people involved with kink—including those who are heterosexual and/or cisgender. The flag itself is open to interpretation, composed of nine horizontal stripes alternating in color between black and blue, a white stripe in the middle, and a red heart in the upper lefthand corner. DeBlase indicated that he wanted to “leave it to the viewer to interpret the colors and symbols.”"
},
{
    "Image_url": "https://www.rd.com/wp-content/uploads/2021/05/bear-brotherhood-flag-1.jpg?resize=700,467",
    "flag_name": "Bear Brotherhood Flag",
    "flag_description": "Members of the International Bear Brotherhood—comprised of gay men with a specific set of physical traits, including facial hair and a sturdy build—got their own flag in 1995. The dark brown, orange/rust, golden yellow, tan, white, gray, and black stripes of the flag represent the fur colors of bears (the animal)."
},
{
    "Image_url": "https://www.rd.com/wp-content/uploads/2021/05/rubber-pride-flag.jpg?resize=700,467",
    "flag_name": "Rubber Pride Flag",
    "flag_description": "Members of the rubber and latex fetish community got their own flag in 1995, courtesy of co-designers Peter Tolos and Scott Moats. According to the pair, the black color on the flag represents leather itself, while the red is a symbol of the group’s “blood passion for rubber and rubbermen” and the yellow stands for their “drive for intense rubber play and fantasies.” And yes, the design is a literal kink."
},
{
    "Image_url": "https://64.media.tumblr.com/5359b1c34fc975096406da42235b0de2/tumblr_inline_orfj15VYxG1re2bou_1280.png",
    "flag_name": "QPOC Pride Flag",
    "flag_description": "Though it may have been used before, 2020 saw the display of the QPOC Pride Flag rise in popularity in the broader queer community as a sign of solidarity with Black Lives Matter demonstrations. The flag represents queer people of color (QPOC) and how the black community and the queer community are often woven together, both currently and in the earliest days of the Queer Liberation Movement (see Marsha P. Johnson, the black drag queen thought to have thrown the first brick at the Stonewall Inn Riots). Historically, the raised fist has served as an emblem of solidarity and support as well as an expression of unity, strength, defiance, and resistance. The raised fist was added to the six-striped flag and includes various shades of brown and a white stripe to represent the various colors of the “human rainbow.” The flags use has mostly been in the digital sphere, but it was flown at the 2019 San Francisco Pride. TriPride has not discovered the original creator."
}
]